<?php

/**
 *  2Moons 
 *   by Jan-Otto Kröpke 2009-2016
 *
 * For the full copyright and license information, please view the LICENSE
 *
 * @package 2Moons
 * @author Jan-Otto Kröpke <slaver7@gmail.com>
 * @copyright 2009 Lucky
 * @copyright 2016 Jan-Otto Kröpke <slaver7@gmail.com>
 * @licence MIT
 * @version 1.8.0
 * @link https://github.com/jkroepke/2Moons
 */

// Translation into Russian - Copyright © 2010-2013 InquisitorEA <support@moon-hunt.ru>

setlocale(LC_ALL, 'ru_RU.UTF8', 'russian'); // http://msdn.microsoft.com/en-us/library/39cwe7zf%28vs.71%29.aspx
setlocale(LC_NUMERIC, 'C');

// Дата и время
$LNG['dir']            = 'ltr';
$LNG['week_day']       = array('Вск', 'Пнд', 'Втр', 'Срд', 'Чтв', 'Птн', 'Сбт');
$LNG['months']         = array('Янв', 'Фев', 'Мар', 'Апр', 'Май', 'Июн', 'Июл', 'Авг', 'Сен', 'Окт', 'Ноя', 'Дек');
$LNG['js_tdformat']    = '[M] [D] [d] [H]:[i]:[s]';
$LNG['php_timeformat'] = 'H:i:s';
$LNG['php_dateformat'] = 'd. M Y';
$LNG['php_tdformat']   = 'd. M Y, H:i:s';
$LNG['short_day']      = 'd';
$LNG['short_hour']     = 'h';
$LNG['short_minute']   = 'm';
$LNG['short_second']   = 's';

$LNG['timezones'] = array(
	'-12'	=> '[UTC − 12] Меридиан смены дат (запад)',
	'-11'	=> '[UTC − 11] о. Мидуэй, Самоа',
	'-10'	=> '[UTC − 10] Гавайи',
	'-9.5'	=> '[UTC − 9:30] Маркизские острова',
	'-9'	=> '[UTC − 9] Аляска',
	'-8'	=> '[UTC − 8] Тихоокеанское время (США и Канада) и Тихуана',
	'-7'	=> '[UTC − 7] Аризона',
	'-6'	=> '[UTC − 6] Мехико, Центральная Америка, Центральное время (США и Канада)',
	'-5'	=> '[UTC − 5] Индиана (восток), Восточное время (США и Канада)',
	'-4.5'	=> '[UTC − 4:30] Венесуэла',
	'-4'	=> '[UTC − 4] Сантьяго, Атлантическое время (Канада)',
	'-3.5'	=> '[UTC − 3:30] Ньюфаундленд',
	'-3'	=> '[UTC − 3] Бразилия, Гренландия',
	'-2'	=> '[UTC − 2] Среднеатлантическое время',
	'-1'	=> '[UTC − 1] Азорские острова, острова Зелёного мыса',
	'0'		=> '[UTC] Время по Гринвичу: Дублин, Лондон, Лиссабон, Эдинбург',
	'1'		=> '[UTC + 1] Берлин, Мадрид, Париж, Рим, Западная Центральная Африка',
	'2'		=> '[UTC + 2] Афины, Вильнюс, Киев, Минск, Рига, Таллин, Центральная Африка',
	'3'		=> '[UTC + 3] Волгоград, Москва, Самара, Санкт-Петербург',
	'3.5'	=> '[UTC + 3:30] Тегеран',
	'4'		=> '[UTC + 4] Баку, Ереван, Тбилиси',
	'4.5'	=> '[UTC + 4:30] Кабул',
	'5'		=> '[UTC + 5] Екатеринбург, Исламабад, Карачи, Оренбург, Ташкент',
	'5.5'	=> '[UTC + 5:30] Бомбей, Калькутта, Мадрас, Нью-Дели',
	'5.75'	=> '[UTC + 5:45] Катманду',
	'6'		=> '[UTC + 6] Алматы, Астана, Новосибирск, Омск',
	'6.5'	=> '[UTC + 6:30] Рангун',
	'7'		=> '[UTC + 7] Бангкок, Красноярск',
	'8'		=> '[UTC + 8] Гонконг, Иркутск, Пекин, Сингапур',
	'8.75'	=> '[UTC + 8:45] Юго-восточная Западная Австралия',
	'9'		=> '[UTC + 9] Токио, Сеул, Чита, Якутск',
	'9.5'	=> '[UTC + 9:30] Дарвин',
	'10'	=> '[UTC + 10] Владивосток, Канберра, Мельбурн, Сидней',
	'10.5'	=> '[UTC + 10:30] Лорд-Хау',
	'11'	=> '[UTC + 11] Камчатка, Магадан, Сахалин, Соломоновы о-ва',
	'11.5'	=> '[UTC + 11:30] Остров Норфолк',
	'12'	=> '[UTC + 12] Новая Зеландия, Фиджи',
	'12.75'	=> '[UTC + 12:45] Острова Чатем',
	'13'	=> '[UTC + 13] Острова Феникс, Тонга',
	'14'	=> '[UTC + 14] Остров Лайн',
);
$LNG['timezones'] = array (
  -12 => '[UTC - 12] Время острова Бейкер',
  -11 => '[UTC - 11] Время Ниуэ, Самоа',
  -10 => '[UTC - 10] Время Гавайев и Алеутских островов, островов Кука',
  '-9.5' => '[UTC - 9:30] Время Маркизских островов',
  -9 => '[UTC - 9] Время Аляски, островов Гамбье',
  -8 => '[UTC - 8] Время тихоокеанское',
  -7 => '[UTC - 7] Время горное',
  -6 => '[UTC - 6] Время центральное',
  -5 => '[UTC - 5] Время восточное',
  '-4.5' => '[UTC - 4:30] Время Венесуэлы',
  -4 => '[UTC - 4] Время атлантическое',
  '-3.5' => '[UTC - 3:30] Время Ньюфаундленда',
  -3 => '[UTC - 3] Время Амазонии, центральной Гренландии',
  -2 => '[UTC - 2] Время Фернанду-ди-Норонья, Южной Георгии и Южных Сандвичевых островов',
  -1 => '[UTC - 1] Время Азорских островов, Кабо-Верде, восточной Гренландии',
  0 => '[UTC] Время Западной Европы, Гринвича',
  1 => '[UTC + 1] Время Центральной Европы, Западной Африки',
  2 => '[UTC + 2] Время Восточной Европы, Центральной Африки',
  3 => '[UTC + 3] Время Москвы, Восточной Африки',
  '3.5' => '[UTC + 3:30] Время Ирана',
  4 => '[UTC + 4] Время Персидского залива, Самары',
  '4.5' => '[UTC + 4:30] Время Афганистана',
  5 => '[UTC + 5] Время Пакистана, Екатеринбурга',
  '5.5' => '[UTC + 5:30] Время Индии, Шри-Ланки',
  '5.75' => '[UTC + 5:45] Время Непала',
  6 => '[UTC + 6] Время Бангладеш, Бутана, Новосибирска',
  '6.5' => '[UTC + 6:30] Время Кокосовых островов, Мьянмы',
  7 => '[UTC + 7] Время Индокитая, Красноярска',
  8 => '[UTC + 8] Время Китая, Западной Австралии, Иркутска',
  '8.75' => '[UTC + 8:45] Время юго-востока Западной Австралии',
  9 => '[UTC + 9] Время Японии, Кореи, Читы',
  '9.5' => '[UTC + 9:30] Время Центральной Австралии',
  10 => '[UTC + 10] Время Восточной Австралии, Владивостока',
  '10.5' => '[UTC + 10:30] Время острова Лорд-Хау',
  11 => '[UTC + 11] Время Соломоновых островов, Магадана',
  '11.5' => '[UTC + 11:30] Время острова Норфолк',
  12 => '[UTC + 12] Время Новой Зеландии, Фиджи, Камчатки',
  '12.75' => '[UTC + 12:45] Время островов Чатем',
  13 => '[UTC + 13] Время Тонга, островов Феникс',
  14 => '[UTC + 14] Время островов Лайн',
);
